pages/homework.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Touring Turing</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Touring Turing</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/7-CS-Turing">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="7_Lesson.html">Week7</a></li>
      <li><a href="homework.html">Homework</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Homework</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Homework 1</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>Note:</b> The answers to all these questions can be obtained from the week 1 notes.
</li>
<li>What symbol do we use for assigning a value to a variable? 
</li>
<li>What symbol do we place around text when storing it in a variable?
</li>
<li>What is wrong with each of these variable names?
<ul class="org-ul">
<li>4myBirthday
</li>
<li>For My Birthday
</li>
<li>ForMyBirthday!
</li>
</ul>
</li>
<li>Name three different data types in Python.
</li>
<li>What does the % operator do in Python?
</li>

<li>Answers to be submitted for the homework 1 badge on <a href="https://www.bournetolearn.com/">BourneToLearn</a>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Homework 2</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>What would be the result of the following sets of code?
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"># Question 1. Keeping the doctor at bay.
apples = 2
days = 365
annualApples = apples * days

print(annualApples)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># Question 2. Leftovers.
daysInYear = 365
daysInWeek = 7
weeksinYear = daysInYear // daysInWeek
whatsLeft = daysInYear % daysInWeek

print(weeksInYear)
print(whatsLeft)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># Question 3. On the up.
a = 5
b = 10
c = 2
a = a + 1
a = a + 1

print (a)
print(b + c)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># Question 4. As I was going to St. Ives...
man = 1
wives = 7
sacks = 7
cats = 7
kittens = 7
goingToStIves = man + wives + (wives * sacks) + (wives * sacks * cats) + (wives * sacks * cats * kittens)

print(goingToStIves)
</pre>
</div>


<ul class="org-ul">
<li>Answers to be submitted for the homework 2 badge on <a href="https://www.bournetolearn.com/">BourneToLearn</a>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Homework 3</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>What outputs do the following sets of code produce?
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"># Quick calculation.
numberA = 42
numberB = 3.142
yourAnswer = 100

if numberA + numberB &gt;= yourAnswer:
    print("That's interesting.")
else:
    print("Good effort.")
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># Cool calculator
yearsOld = 12
daysOld = 365.25 * yearsOld

if daysOld &gt; 7300:
    print("You are really old")
elif daysOld &gt; 5000:
    print("You're getting on a bit")
else:
    print("You're young and happening!")

print("Thank you for playing")
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># Poorly scored quiz...
score = 0
capitalEngland = "London"
capitalAustralia = "Sydney"
capitalFrance = "Paris"

if capitalEngland == "London" or capitalEngland == "LONDON":
    score += 1

if capitalAustralia == "Canberra" and capitalFrance == "Paris":
    score +=2

print("You scored: " + str(score))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># The drinks machine
wantsTea = True
wantsSugar = False
wantsMilk = True

if wantsTea == True:
    if wantsSugar == True:
	if wantsMilk == True:
	    print("Drink A")
	else:
	    print("Drink B.")
    else:
	if wantsMilk == True:
	    print("Drink C")
	else:
	    print("Drink D")
else:
    print("Drink E")
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># Used car value calculator...
carMake = "Morris"
newPrice = 4000
condition = "Good"

if carMake == "Fjord" or carMake = "Austin":
    discount = 0.8
elif carMake == "Morris:"
    discount = 0.5
else:
    discount = 0.75

usedPrice = newPrice * discount

if condition == "Excellent":
    discount = 0.8
elif condition == "Good" or condition == "Fair":
    discount = 0.75
else:
    discount = 0.5

usedPrice = usedPrice * discount
print("It's worth £" + str(usedPrice))
</pre>
</div>

<ul class="org-ul">
<li>Answers to be submitted as a text file, uploaded into the homework 3 badge on <a href="https://www.bournetolearn.com/">BourneToLearn</a>.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
